## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.api.aws_ecs_task_definition.default[0] has changed
  ~ resource "aws_ecs_task_definition" "default" {
        id                       = "gost-staging-api"
+       tags                     = {}
        # (13 unchanged attributes hidden)

+       volume {
+           name = "data"

+           efs_volume_configuration {
+               file_system_id          = "fs-08f95063c1cdbe191"
+               root_directory          = "/"
+               transit_encryption      = "ENABLED"
+               transit_encryption_port = 0

+               authorization_config {
+                   access_point_id = "fsap-03bc0296928aade4f"
                }
            }
        }
-       volume {
-           name = "data" -> null

-           efs_volume_configuration {
-               file_system_id     = "fs-08f95063c1cdbe191" -> null
-               root_directory     = "/" -> null
-               transit_encryption = "ENABLED" -> null

-               authorization_config {
-                   access_point_id = "fsap-03bc0296928aade4f" -> null
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # module.api.aws_iam_role.execution[0] has changed
  ~ resource "aws_iam_role" "execution" {
        id                    = "gost-staging-api-ECSTaskExecution-20230217010414321500000009"
        name                  = "gost-staging-api-ECSTaskExecution-20230217010414321500000009"
      ~ role_last_used        = [
          ~ {
              ~ last_used_date = "2024-04-18T13:17:51Z" -> "2024-04-18T16:15:12Z"
                # (1 unchanged element hidden)
            },
        ]
        tags                  = {}
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.api.aws_iam_role.task[0] has changed
  ~ resource "aws_iam_role" "task" {
        id                    = "gost-staging-api-ECSTask-2023021701041477300000000a"
        name                  = "gost-staging-api-ECSTask-2023021701041477300000000a"
      ~ role_last_used        = [
          ~ {
              ~ last_used_date = "2024-04-18T13:17:59Z" -> "2024-04-18T14:39:22Z"
                # (1 unchanged element hidden)
            },
        ]
        tags                  = {}
        # (11 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.api.module.efs_data_volume.aws_efs_file_system.default[0] has changed
  ~ resource "aws_efs_file_system" "default" {
        id                              = "fs-08f95063c1cdbe191"
      ~ size_in_bytes                   = [
          ~ {
              ~ value             = 303945728 -> 315299840
              ~ value_in_standard = 303945728 -> 315299840
                # (1 unchanged element hidden)
            },
        ]
        tags                            = {
            "Name"      = "gost-staging-gost-staging-datavolume"
            "Namespace" = "gost-staging"
        }
        # (11 unchanged attributes hidden)
    }

  # module.api.module.grant_digest_scheduled_task.aws_iam_role.default[0] has changed
  ~ resource "aws_iam_role" "default" {
        id                    = "gost-staging-grant-digest-task20240404183104701000000001"
        name                  = "gost-staging-grant-digest-task20240404183104701000000001"
      ~ role_last_used        = [
          ~ {
              ~ last_used_date = "2024-04-17T13:54:10Z" -> "2024-04-18T13:54:10Z"
                # (1 unchanged element hidden)
            },
        ]
        tags                  = {}
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.api.aws_ecs_service.default[0] will be updated in-place
  ~ resource "aws_ecs_service" "default" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/gost-staging/gost-staging-api"
        name                               = "gost-staging-api"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-api:229" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api.aws_ecs_task_definition.default[0] must be replaced
+/- resource "aws_ecs_task_definition" "default" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-api:229" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-api" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  ~ dockerLabels           = {
                      ~ "com.datadoghq.tags.version" = "f6a515ad2c4277440be83ecdc31336c1688b9f12" -> "6853626faa9262ed84bf67bcaa341233d9884a46"
                        # (2 unchanged elements hidden)
                    }
                  ~ environment            = [
                        # (7 unchanged elements hidden)
                        {
                            name  = "DD_SERVICE"
                            value = "gost"
                        },
                      ~ {
                            name  = "DD_VERSION"
                          ~ value = "f6a515ad2c4277440be83ecdc31336c1688b9f12" -> "6853626faa9262ed84bf67bcaa341233d9884a46"
                        },
                        {
                            name  = "ENABLE_GRANTS_SCRAPER"
                            value = "false"
                        },
                        # (12 unchanged elements hidden)
                    ]
                  ~ image                  = "ghcr.io/usdigitalresponse/usdr-gost-api:f6a515ad2c4277440be83ecdc31336c1688b9f12@sha256:8845cc41079743768e9f3796dda5d5f844a342a282ace096fecbbd1eb6f13f1a" -> "ghcr.io/usdigitalresponse/usdr-gost-api:6853626faa9262ed84bf67bcaa341233d9884a46@sha256:ba3de90e6c6a168c99ac2182ce079153d7d6bf9f590af175aa319f10fb897593"
                    name                   = "api"
-                   systemControls         = [] -> null
-                   volumesFrom            = [] -> null
                    # (9 unchanged elements hidden)
                } # forces replacement,
              ~ {
                  ~ dockerLabels           = {
                      ~ "com.datadoghq.tags.version" = "f6a515ad2c4277440be83ecdc31336c1688b9f12" -> "6853626faa9262ed84bf67bcaa341233d9884a46"
                        # (2 unchanged elements hidden)
                    }
                  ~ environment            = [
                        # (3 unchanged elements hidden)
                        {
                            name  = "DD_SERVICE"
                            value = "gost"
                        },
                      ~ {
                            name  = "DD_VERSION"
                          ~ value = "f6a515ad2c4277440be83ecdc31336c1688b9f12" -> "6853626faa9262ed84bf67bcaa341233d9884a46"
                        },
                        {
                            name  = "ECS_FARGATE"
                            value = "true"
                        },
                    ]
-                   mountPoints            = [] -> null
                    name                   = "datadog"
-                   portMappings           = [] -> null
-                   systemControls         = [] -> null
-                   volumesFrom            = [] -> null
                    # (6 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "gost-staging-api" -> (known after apply)
      ~ revision                 = 229 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

-       volume {
-           name = "data" -> null

-           efs_volume_configuration {
-               file_system_id          = "fs-08f95063c1cdbe191" -> null
-               root_directory          = "/" -> null
-               transit_encryption      = "ENABLED" -> null
-               transit_encryption_port = 0 -> null

-               authorization_config {
-                   access_point_id = "fsap-03bc0296928aade4f" -> null
                }
            }
        }
+       volume {
+           name = "data"

+           efs_volume_configuration {
+               file_system_id     = "fs-08f95063c1cdbe191"
+               root_directory     = "/"
+               transit_encryption = "ENABLED"

+               authorization_config {
+                   access_point_id = "fsap-03bc0296928aade4f"
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # module.arpa_audit_report.aws_ecs_service.default will be updated in-place
  ~ resource "aws_ecs_service" "default" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/gost-staging/gost-staging-arpa_audit_report"
        name                               = "gost-staging-arpa_audit_report"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-arpa_audit_report:198" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.arpa_audit_report.aws_ecs_task_definition.consumer must be replaced
+/- resource "aws_ecs_task_definition" "consumer" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-arpa_audit_report:198" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-arpa_audit_report" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "gost-staging-arpa_audit_report" -> (known after apply)
-       ipc_mode                 = "" -> null
-       pid_mode                 = "" -> null
      ~ revision                 = 198 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

-       volume {
-           name = "data" -> null

-           efs_volume_configuration {
-               file_system_id          = "fs-08f95063c1cdbe191" -> null
-               root_directory          = "/" -> null
-               transit_encryption      = "ENABLED" -> null
-               transit_encryption_port = 0 -> null

-               authorization_config {
-                   access_point_id = "fsap-03bc0296928aade4f" -> null
                }
            }
        }
+       volume {
+           name = "data"

+           efs_volume_configuration {
+               file_system_id     = "fs-08f95063c1cdbe191"
+               root_directory     = "/"
+               transit_encryption = "ENABLED"

+               authorization_config {
+                   access_point_id = "fsap-03bc0296928aade4f"
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # module.arpa_treasury_report.aws_ecs_service.default will be updated in-place
  ~ resource "aws_ecs_service" "default" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/gost-staging/gost-staging-treasury_report"
        name                               = "gost-staging-treasury_report"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-treasury_report:187" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.arpa_treasury_report.aws_ecs_task_definition.consumer must be replaced
+/- resource "aws_ecs_task_definition" "consumer" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-treasury_report:187" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-treasury_report" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "gost-staging-treasury_report" -> (known after apply)
-       ipc_mode                 = "" -> null
-       pid_mode                 = "" -> null
      ~ revision                 = 187 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

-       volume {
-           name = "data" -> null

-           efs_volume_configuration {
-               file_system_id          = "fs-08f95063c1cdbe191" -> null
-               root_directory          = "/" -> null
-               transit_encryption      = "ENABLED" -> null
-               transit_encryption_port = 0 -> null

-               authorization_config {
-                   access_point_id = "fsap-03bc0296928aade4f" -> null
                }
            }
        }
+       volume {
+           name = "data"

+           efs_volume_configuration {
+               file_system_id     = "fs-08f95063c1cdbe191"
+               root_directory     = "/"
+               transit_encryption = "ENABLED"

+               authorization_config {
+                   access_point_id = "fsap-03bc0296928aade4f"
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # module.consume_grants.aws_ecs_service.default will be updated in-place
  ~ resource "aws_ecs_service" "default" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/gost-staging/gost-staging-consume_grants"
        name                               = "gost-staging-consume_grants"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-consume_grants:214" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.consume_grants.aws_ecs_task_definition.consume_grants must be replaced
+/- resource "aws_ecs_task_definition" "consume_grants" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-consume_grants:214" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-consume_grants" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "gost-staging-consume_grants" -> (known after apply)
-       ipc_mode                 = "" -> null
-       pid_mode                 = "" -> null
      ~ revision                 = 214 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.website.aws_s3_object.deploy-config[0] will be updated in-place
  ~ resource "aws_s3_object" "deploy-config" {
      ~ content                = <<-EOT
            window.APP_CONFIG = window.APP_CONFIG || {};
            window.APP_CONFIG.apiURLForGOST = 'https://api.staging.grants.usdr.dev/';
            window.apiURLForGOST = window.APP_CONFIG.apiURLForGOST; // Legacy
            
            window.APP_CONFIG.DD_RUM_ENABLED = true;
-           window.APP_CONFIG.DD_RUM_CONFIG = {"allowedTracingUrls":["https://api.staging.grants.usdr.dev"],"applicationId":"15db471e-2ccb-4d3c-a6bf-99b750d748f5","clientToken":"pub50834fcc1999d53e546519b1a0f03934","defaultPrivacyLevel":"mask","env":"staging","service":"gost","sessionReplaySampleRate":100,"sessionSampleRate":100,"site":"datadoghq.com","trackLongTasks":true,"trackResources":true,"trackUserInteractions":true,"version":"f6a515ad2c4277440be83ecdc31336c1688b9f12"};
+           window.APP_CONFIG.DD_RUM_CONFIG = {"allowedTracingUrls":["https://api.staging.grants.usdr.dev"],"applicationId":"15db471e-2ccb-4d3c-a6bf-99b750d748f5","clientToken":"pub50834fcc1999d53e546519b1a0f03934","defaultPrivacyLevel":"mask","env":"staging","service":"gost","sessionReplaySampleRate":100,"sessionSampleRate":100,"site":"datadoghq.com","trackLongTasks":true,"trackResources":true,"trackUserInteractions":true,"version":"6853626faa9262ed84bf67bcaa341233d9884a46"};
            
            window.APP_CONFIG.GOOGLE_TAG_ID = 'G-D5DFR7BN0N';
            
-           window.APP_CONFIG.featureFlags = {"myProfileEnabled":true,"newGrantsDetailPageEnabled":true,"newTerminologyEnabled":true};
+           window.APP_CONFIG.featureFlags = {"newGrantsDetailPageEnabled":true,"newTerminologyEnabled":true};
            
            window.APP_CONFIG.overrideFeatureFlag = (flagName, overrideValue) => {
              const storageKey = 'featureFlags';
              let overrides = {};
              try {
                overrides = JSON.parse(window.sessionStorage.getItem(storageKey)) || {};
              } catch (e) {
                console.error(`Error parsing window.sessionStorage.${storageKey} as JSON:`, e);
                console.warn(`window.sessionStorage.${storageKey} will be replaced.`);
              }
              overrides[flagName] = overrideValue;
              window.sessionStorage.setItem(storageKey, JSON.stringify(overrides));
              console.log('New feature flag overrides in page session:',
                window.sessionStorage.getItem(storageKey));
            };
        EOT
      ~ etag                   = "4be1f374899f599a67fa7e2b9d900b0b" -> "3cb5b2dcbbc743b0923694d4334f9c3a"
        id                     = "/config/deploy-config.js"
        tags                   = {}
      ~ version_id             = "WFcbvRkfzGv5VvkVF0yxNXTuO_vDa070" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.website.aws_s3_object.origin_dist_artifact["arpa_reporter/index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "6e9571e39569fcb1c7746e5405853321" -> "c7846dd5ef57d71307f02d6b0c140f80"
        id                     = "dist/arpa_reporter/index.html"
      ~ source_hash            = "6e9571e39569fcb1c7746e5405853321" -> "c7846dd5ef57d71307f02d6b0c140f80"
        tags                   = {}
      ~ version_id             = "3OfTR0pLrusGexJYWGPZwzD7pylMsNKG" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.website.aws_s3_object.origin_dist_artifact["css/main.5fc37fe3.css"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = "private"
+       bucket                 = "gost-staging-origin-357150818708-us-west-2-website"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "text/css"
+       etag                   = "e22c58148cbfe19c64f8160472077b04"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/css/main.5fc37fe3.css"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/css/main.5fc37fe3.css"
+       source_hash            = "e22c58148cbfe19c64f8160472077b04"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.website.aws_s3_object.origin_dist_artifact["css/main.87fe8b24.css"] will be destroyed
  # (because key ["css/main.87fe8b24.css"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       acl                    = "private" -> null
-       bucket                 = "gost-staging-origin-357150818708-us-west-2-website" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/css" -> null
-       etag                   = "01f039736e6d66a9fb9435ed32a5b26c" -> null
-       force_destroy          = false -> null
-       id                     = "dist/css/main.87fe8b24.css" -> null
-       key                    = "dist/css/main.87fe8b24.css" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/css/main.87fe8b24.css" -> null
-       source_hash            = "01f039736e6d66a9fb9435ed32a5b26c" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "usdr-gost"
-           "service"    = "gost"
-           "usage"      = "workload"
        } -> null
-       version_id             = "4CVXJoBys3yVD3qfUpUnaYFaOyufAvXI" -> null
    }

  # module.website.aws_s3_object.origin_dist_artifact["img/usdr_logo_white_wide.4158100a.svg"] will be destroyed
  # (because key ["img/usdr_logo_white_wide.4158100a.svg"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       acl                    = "private" -> null
-       bucket                 = "gost-staging-origin-357150818708-us-west-2-website" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "image/svg+xml" -> null
-       etag                   = "28cdeba067592a84e1123ea5b3102e13" -> null
-       force_destroy          = false -> null
-       id                     = "dist/img/usdr_logo_white_wide.4158100a.svg" -> null
-       key                    = "dist/img/usdr_logo_white_wide.4158100a.svg" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/img/usdr_logo_white_wide.4158100a.svg" -> null
-       source_hash            = "28cdeba067592a84e1123ea5b3102e13" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "usdr-gost"
-           "service"    = "gost"
-           "usage"      = "workload"
        } -> null
-       version_id             = "0IAOctp3c0z4xIQqifK_ioQNc5kHKjlq" -> null
    }

  # module.website.aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "722801a5652a126b1da2b1fbb0bd5b92" -> "5b086e93f7940c21bdc39f24cec24e27"
        id                     = "dist/index.html"
      ~ source_hash            = "722801a5652a126b1da2b1fbb0bd5b92" -> "5b086e93f7940c21bdc39f24cec24e27"
        tags                   = {}
      ~ version_id             = "Ijybk2PIex6TuIX5Wt8oK3X.ph1xKpP1" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/223.66070969.js"] will be destroyed
  # (because key ["js/223.66070969.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       acl                    = "private" -> null
-       bucket                 = "gost-staging-origin-357150818708-us-west-2-website" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "08d1e6c73b3c861a908e83216ed3f235" -> null
-       force_destroy          = false -> null
-       id                     = "dist/js/223.66070969.js" -> null
-       key                    = "dist/js/223.66070969.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/223.66070969.js" -> null
-       source_hash            = "08d1e6c73b3c861a908e83216ed3f235" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "usdr-gost"
-           "service"    = "gost"
-           "usage"      = "workload"
        } -> null
-       version_id             = "R8HNam5W_RVxtwb.qj57antRoEDMnwwt" -> null
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/223.66070969.js.map"] will be destroyed
  # (because key ["js/223.66070969.js.map"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       acl                    = "private" -> null
-       bucket                 = "gost-staging-origin-357150818708-us-west-2-website" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "application/json" -> null
-       etag                   = "ad6f6fe4d5db3549891b86157dbcbafe" -> null
-       force_destroy          = false -> null
-       id                     = "dist/js/223.66070969.js.map" -> null
-       key                    = "dist/js/223.66070969.js.map" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/223.66070969.js.map" -> null
-       source_hash            = "ad6f6fe4d5db3549891b86157dbcbafe" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "usdr-gost"
-           "service"    = "gost"
-           "usage"      = "workload"
        } -> null
-       version_id             = "KQdx7tN9BRRl1EMDarRuaeaVXWkvLN3P" -> null
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/223.7b7a2706.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = "private"
+       bucket                 = "gost-staging-origin-357150818708-us-west-2-website"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "a9f3f4e6ac4ff2884512fe536121f06e"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/js/223.7b7a2706.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/223.7b7a2706.js"
+       source_hash            = "a9f3f4e6ac4ff2884512fe536121f06e"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/223.7b7a2706.js.map"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = "private"
+       bucket                 = "gost-staging-origin-357150818708-us-west-2-website"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "application/json"
+       etag                   = "b639dd26d977b1e7e9a14d854d051946"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/js/223.7b7a2706.js.map"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/223.7b7a2706.js.map"
+       source_hash            = "b639dd26d977b1e7e9a14d854d051946"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/40.e3b39a73.js"] will be destroyed
  # (because key ["js/40.e3b39a73.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       acl                    = "private" -> null
-       bucket                 = "gost-staging-origin-357150818708-us-west-2-website" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "314e23405be700293f93db6fcba52c8e" -> null
-       force_destroy          = false -> null
-       id                     = "dist/js/40.e3b39a73.js" -> null
-       key                    = "dist/js/40.e3b39a73.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/40.e3b39a73.js" -> null
-       source_hash            = "314e23405be700293f93db6fcba52c8e" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "usdr-gost"
-           "service"    = "gost"
-           "usage"      = "workload"
        } -> null
-       version_id             = "IMaeJ3vPY35SGFiVymg07MYF.tjTVhV7" -> null
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/40.e3b39a73.js.map"] will be destroyed
  # (because key ["js/40.e3b39a73.js.map"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       acl                    = "private" -> null
-       bucket                 = "gost-staging-origin-357150818708-us-west-2-website" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "application/json" -> null
-       etag                   = "40458df830450598c35aff95f3fdaa08" -> null
-       force_destroy          = false -> null
-       id                     = "dist/js/40.e3b39a73.js.map" -> null
-       key                    = "dist/js/40.e3b39a73.js.map" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/40.e3b39a73.js.map" -> null
-       source_hash            = "40458df830450598c35aff95f3fdaa08" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "usdr-gost"
-           "service"    = "gost"
-           "usage"      = "workload"
        } -> null
-       version_id             = "zXcqHRl0LHh31ahJanfhmvfPiDnhr8Z9" -> null
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/40.f8ddbe0d.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = "private"
+       bucket                 = "gost-staging-origin-357150818708-us-west-2-website"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "ae2a1e0a46db05ab7fae1fb2b87b0359"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/js/40.f8ddbe0d.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/40.f8ddbe0d.js"
+       source_hash            = "ae2a1e0a46db05ab7fae1fb2b87b0359"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/40.f8ddbe0d.js.map"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = "private"
+       bucket                 = "gost-staging-origin-357150818708-us-west-2-website"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "application/json"
+       etag                   = "713e0afa96fa7af1c27471ccb20013c2"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/js/40.f8ddbe0d.js.map"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/40.f8ddbe0d.js.map"
+       source_hash            = "713e0afa96fa7af1c27471ccb20013c2"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/466.506ec521.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = "private"
+       bucket                 = "gost-staging-origin-357150818708-us-west-2-website"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "97463b5929331b5ded78996c35fe6efb"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/js/466.506ec521.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/466.506ec521.js"
+       source_hash            = "97463b5929331b5ded78996c35fe6efb"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/466.506ec521.js.map"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = "private"
+       bucket                 = "gost-staging-origin-357150818708-us-west-2-website"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "application/json"
+       etag                   = "9ab91e29cdac52f5ad51ee0199f51d4e"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/js/466.506ec521.js.map"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/466.506ec521.js.map"
+       source_hash            = "9ab91e29cdac52f5ad51ee0199f51d4e"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/466.ca7f7296.js"] will be destroyed
  # (because key ["js/466.ca7f7296.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       acl                    = "private" -> null
-       bucket                 = "gost-staging-origin-357150818708-us-west-2-website" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "0b89e9b4ca4a94f88da614295dfea84f" -> null
-       force_destroy          = false -> null
-       id                     = "dist/js/466.ca7f7296.js" -> null
-       key                    = "dist/js/466.ca7f7296.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/466.ca7f7296.js" -> null
-       source_hash            = "0b89e9b4ca4a94f88da614295dfea84f" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "usdr-gost"
-           "service"    = "gost"
-           "usage"      = "workload"
        } -> null
-       version_id             = "4L9eVEw0Icagg4mV2xcp1LiXhm1MrUK1" -> null
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/466.ca7f7296.js.map"] will be destroyed
  # (because key ["js/466.ca7f7296.js.map"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       acl                    = "private" -> null
-       bucket                 = "gost-staging-origin-357150818708-us-west-2-website" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "application/json" -> null
-       etag                   = "6bcb61cd1bf56082476d0e43ab9464b2" -> null
-       force_destroy          = false -> null
-       id                     = "dist/js/466.ca7f7296.js.map" -> null
-       key                    = "dist/js/466.ca7f7296.js.map" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/466.ca7f7296.js.map" -> null
-       source_hash            = "6bcb61cd1bf56082476d0e43ab9464b2" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "usdr-gost"
-           "service"    = "gost"
-           "usage"      = "workload"
        } -> null
-       version_id             = "TnXSA_jkwMm2uVGNynk5TUVQnL3e3BFT" -> null
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/582.03f040b6.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = "private"
+       bucket                 = "gost-staging-origin-357150818708-us-west-2-website"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "5ec4ac6b94f2e90d15c6f143e53194f7"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/js/582.03f040b6.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/582.03f040b6.js"
+       source_hash            = "5ec4ac6b94f2e90d15c6f143e53194f7"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/582.03f040b6.js.map"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = "private"
+       bucket                 = "gost-staging-origin-357150818708-us-west-2-website"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "application/json"
+       etag                   = "4cb6b1574da945435b4bd6b3924475fc"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/js/582.03f040b6.js.map"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/582.03f040b6.js.map"
+       source_hash            = "4cb6b1574da945435b4bd6b3924475fc"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/582.f56b76ea.js"] will be destroyed
  # (because key ["js/582.f56b76ea.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       acl                    = "private" -> null
-       bucket                 = "gost-staging-origin-357150818708-us-west-2-website" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "1719648aad688ad159bfd589f947db3d" -> null
-       force_destroy          = false -> null
-       id                     = "dist/js/582.f56b76ea.js" -> null
-       key                    = "dist/js/582.f56b76ea.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/582.f56b76ea.js" -> null
-       source_hash            = "1719648aad688ad159bfd589f947db3d" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "usdr-gost"
-           "service"    = "gost"
-           "usage"      = "workload"
        } -> null
-       version_id             = "nY_1akYm7BOhtIY5YVF0cYwUVTFCsZ.k" -> null
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/582.f56b76ea.js.map"] will be destroyed
  # (because key ["js/582.f56b76ea.js.map"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       acl                    = "private" -> null
-       bucket                 = "gost-staging-origin-357150818708-us-west-2-website" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "application/json" -> null
-       etag                   = "f3034a30d3f75c286f403efa6f098730" -> null
-       force_destroy          = false -> null
-       id                     = "dist/js/582.f56b76ea.js.map" -> null
-       key                    = "dist/js/582.f56b76ea.js.map" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/582.f56b76ea.js.map" -> null
-       source_hash            = "f3034a30d3f75c286f403efa6f098730" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "usdr-gost"
-           "service"    = "gost"
-           "usage"      = "workload"
        } -> null
-       version_id             = "uVEb2abtAl.SnpJqHRvCPyh3pUGQlh05" -> null
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/584.ce24347e.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = "private"
+       bucket                 = "gost-staging-origin-357150818708-us-west-2-website"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "3ab8ba8dacc91ae6f97567939ec785dd"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/js/584.ce24347e.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/584.ce24347e.js"
+       source_hash            = "3ab8ba8dacc91ae6f97567939ec785dd"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/584.ce24347e.js.map"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = "private"
+       bucket                 = "gost-staging-origin-357150818708-us-west-2-website"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "application/json"
+       etag                   = "8f01cd3d1679288f5e1d4968875caf53"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/js/584.ce24347e.js.map"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/584.ce24347e.js.map"
+       source_hash            = "8f01cd3d1679288f5e1d4968875caf53"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/584.e774c3a3.js"] will be destroyed
  # (because key ["js/584.e774c3a3.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       acl                    = "private" -> null
-       bucket                 = "gost-staging-origin-357150818708-us-west-2-website" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "28730918e703f33feead039c35694f22" -> null
-       force_destroy          = false -> null
-       id                     = "dist/js/584.e774c3a3.js" -> null
-       key                    = "dist/js/584.e774c3a3.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/584.e774c3a3.js" -> null
-       source_hash            = "28730918e703f33feead039c35694f22" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "usdr-gost"
-           "service"    = "gost"
-           "usage"      = "workload"
        } -> null
-       version_id             = "NYygFZe9C5GjBhiZjwPNqxqHtMWm8Xx." -> null
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/584.e774c3a3.js.map"] will be destroyed
  # (because key ["js/584.e774c3a3.js.map"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       acl                    = "private" -> null
-       bucket                 = "gost-staging-origin-357150818708-us-west-2-website" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "application/json" -> null
-       etag                   = "e20c2824ca4887e438bf419d0e6f0d54" -> null
-       force_destroy          = false -> null
-       id                     = "dist/js/584.e774c3a3.js.map" -> null
-       key                    = "dist/js/584.e774c3a3.js.map" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/584.e774c3a3.js.map" -> null
-       source_hash            = "e20c2824ca4887e438bf419d0e6f0d54" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "usdr-gost"
-           "service"    = "gost"
-           "usage"      = "workload"
        } -> null
-       version_id             = "jOb8Uio0DAPzW8pzDyHP7EPnDtliF5zS" -> null
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/775.72449d0e.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = "private"
+       bucket                 = "gost-staging-origin-357150818708-us-west-2-website"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "64a495125d7d15a30da4296b72a27d36"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/js/775.72449d0e.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/775.72449d0e.js"
+       source_hash            = "64a495125d7d15a30da4296b72a27d36"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/775.72449d0e.js.map"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = "private"
+       bucket                 = "gost-staging-origin-357150818708-us-west-2-website"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "application/json"
+       etag                   = "ce00156bb122962ee053cd3ee8b283dd"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/js/775.72449d0e.js.map"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/775.72449d0e.js.map"
+       source_hash            = "ce00156bb122962ee053cd3ee8b283dd"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/775.e99a60cd.js"] will be destroyed
  # (because key ["js/775.e99a60cd.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       acl                    = "private" -> null
-       bucket                 = "gost-staging-origin-357150818708-us-west-2-website" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "b95610457d576c42685aa681a7500737" -> null
-       force_destroy          = false -> null
-       id                     = "dist/js/775.e99a60cd.js" -> null
-       key                    = "dist/js/775.e99a60cd.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/775.e99a60cd.js" -> null
-       source_hash            = "b95610457d576c42685aa681a7500737" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "usdr-gost"
-           "service"    = "gost"
-           "usage"      = "workload"
        } -> null
-       version_id             = "9RZFazXIhQ38f70RBJg5yZp52zYKzfzx" -> null
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/775.e99a60cd.js.map"] will be destroyed
  # (because key ["js/775.e99a60cd.js.map"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       acl                    = "private" -> null
-       bucket                 = "gost-staging-origin-357150818708-us-west-2-website" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "application/json" -> null
-       etag                   = "7c08a30c168df481db15a4b8ceb4b4aa" -> null
-       force_destroy          = false -> null
-       id                     = "dist/js/775.e99a60cd.js.map" -> null
-       key                    = "dist/js/775.e99a60cd.js.map" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/775.e99a60cd.js.map" -> null
-       source_hash            = "7c08a30c168df481db15a4b8ceb4b4aa" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "usdr-gost"
-           "service"    = "gost"
-           "usage"      = "workload"
        } -> null
-       version_id             = "qEXdQIyJoVSDApL6WSVsjYxMvQOPWh84" -> null
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/860.9fa5f9ec.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = "private"
+       bucket                 = "gost-staging-origin-357150818708-us-west-2-website"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "fc704c017d145c82ad8d7a341b39790f"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/js/860.9fa5f9ec.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/860.9fa5f9ec.js"
+       source_hash            = "fc704c017d145c82ad8d7a341b39790f"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/860.9fa5f9ec.js.map"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = "private"
+       bucket                 = "gost-staging-origin-357150818708-us-west-2-website"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "application/json"
+       etag                   = "1f9b6514e04de713f05ec026fae124fb"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/js/860.9fa5f9ec.js.map"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/860.9fa5f9ec.js.map"
+       source_hash            = "1f9b6514e04de713f05ec026fae124fb"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/860.e6caa3e5.js"] will be destroyed
  # (because key ["js/860.e6caa3e5.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       acl                    = "private" -> null
-       bucket                 = "gost-staging-origin-357150818708-us-west-2-website" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "f43cebd6d197b2f2094af33e608e2c0a" -> null
-       force_destroy          = false -> null
-       id                     = "dist/js/860.e6caa3e5.js" -> null
-       key                    = "dist/js/860.e6caa3e5.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/860.e6caa3e5.js" -> null
-       source_hash            = "f43cebd6d197b2f2094af33e608e2c0a" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "usdr-gost"
-           "service"    = "gost"
-           "usage"      = "workload"
        } -> null
-       version_id             = "uREfBRppZWSP3r.TxHBSG.enUTrrG45j" -> null
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/860.e6caa3e5.js.map"] will be destroyed
  # (because key ["js/860.e6caa3e5.js.map"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       acl                    = "private" -> null
-       bucket                 = "gost-staging-origin-357150818708-us-west-2-website" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "application/json" -> null
-       etag                   = "934e20f2169b77b6ed89da6ca55de512" -> null
-       force_destroy          = false -> null
-       id                     = "dist/js/860.e6caa3e5.js.map" -> null
-       key                    = "dist/js/860.e6caa3e5.js.map" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/860.e6caa3e5.js.map" -> null
-       source_hash            = "934e20f2169b77b6ed89da6ca55de512" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "usdr-gost"
-           "service"    = "gost"
-           "usage"      = "workload"
        } -> null
-       version_id             = "kOrbGyP5Qou51TZJk1OSye05_VlPOnTq" -> null
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/861.22bb7f1f.js"] will be destroyed
  # (because key ["js/861.22bb7f1f.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       acl                    = "private" -> null
-       bucket                 = "gost-staging-origin-357150818708-us-west-2-website" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "fa938e6668145d3723482fa70ec7f443" -> null
-       force_destroy          = false -> null
-       id                     = "dist/js/861.22bb7f1f.js" -> null
-       key                    = "dist/js/861.22bb7f1f.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/861.22bb7f1f.js" -> null
-       source_hash            = "fa938e6668145d3723482fa70ec7f443" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "usdr-gost"
-           "service"    = "gost"
-           "usage"      = "workload"
        } -> null
-       version_id             = "PUNaijech73FcY.MVUdKyOFQ3cHWT1nb" -> null
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/861.22bb7f1f.js.map"] will be destroyed
  # (because key ["js/861.22bb7f1f.js.map"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       acl                    = "private" -> null
-       bucket                 = "gost-staging-origin-357150818708-us-west-2-website" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "application/json" -> null
-       etag                   = "4688f3d755ea549fed98cfe61db4dd7e" -> null
-       force_destroy          = false -> null
-       id                     = "dist/js/861.22bb7f1f.js.map" -> null
-       key                    = "dist/js/861.22bb7f1f.js.map" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/861.22bb7f1f.js.map" -> null
-       source_hash            = "4688f3d755ea549fed98cfe61db4dd7e" -> null
-       storage_class          = "STANDARD" -> null
-      ...*[Comment body truncated]*